{
	"name": "Particle Accelerator",
	"icon": [
		"hbm:pa_detector",
		1,
		0
	],
	"trigger": [
		[
			"hbm:pa_detector"
		]
	],
	"title": {
		"en_us": "Particle Accelerator",
		"ru_ru": "Ускоритель частиц",
		"zh_cn": "粒子加速器"
	},
	"content": {
		"en_us": "A particle accelerator is a large dynamic structure made from multiple components. In short, particles are fired from [[particle sources|Particle Source]] along [[beamlines|Beamline]], accelerated via [[RF cavities|RF Cavity]], refocussed with [[quadrupoles|Quadrupole Magnets]], redirected with [[dipoles|Dipole Magnets]] and finally received by a [[particle detector|Particle Detector]].<br><br>In order for a recipe to complete, a particle, using the correct ingredients, needs to reach the detector with at least the required speed. Particles gain 100 points of momentum when passing an RF cavity, but this also creates 100 points of defocus. Defocus can be reduced with quadrupoles, 100 points at a time. If the defocus exceeds 1000, the particle crashes. Most components are linear, however dipoles can be used to change the particle's path depending on its speed, allowing turns, branches and loops to be made.<br><br>The most simple accelerator is a particle source connected to several RFCs, then quadrupoles for refocusssing and finally the detector, forming a linear accelerator. This however limits the final momentum to the amount of RFCs x100. By using dipoles to form a ring, particles can follow the loop and make use of the same RFCs and quadrupoles multiple times. However, the [[coils|Large Coil]] used by both quadrupoles and dipoles have limits on how fast the particle can be, meaning that once the particle becomes too fast, it needs to leave the ring. One ring however can lead into another, with better coils, which have a higher speed limit. Starting off with higher tier coils right away is not advised, since coils also have a minimum speed, although this doesn't immediately cause the particle to crash. An ideal accelerator that is not subject to any coil penalties and can perform any recipe is one with multiple rings, each using higher tier coils. Dipoles can be configured with redstone so that rings that add more speed than necessary can be skipped, ending the particle's path early.<br><br>In addition to power, most accelerator parts require cooling. [[Cold perfluoromethyl|Perfluoromethyl]] needs to be pumped into the components, which returns room temperature PFM that can be cooled down again. Creating cold PFM requires two sets of [[compressors|Compressor]], one compressing PFM to a pressure of 1 PU and one to compress it further, yielding cold PFM.<br><br>Most parts of the accelerator have a fixed direction that the particle needs to follow. Mind the red arrows on the components.<br><br>A step-by-step guide on how to build a very basic single ring accelerator can be found [[here|PA Guide]]",
		"ru_ru": "Ускоритель частиц - это большая динамическая структура, состоящая из множества компонентов. Говоря кратко, частицы выбрасываются из [[источника частиц|Particle Source]] в [[канал пучка|Beamline]], ускоряются с помощью [[радиочастотных резонаторов|RF Cavity]], восстанавливают фокус с помощью [[квадруполей|Quadrupole Magnets]], перенаправляются с помощью [[диполей|Dipole Magnets]] и, наконец, улавливаются [[детектором частиц|Particle Detector]].<br><br>Для выполнения рецепта частица, использующая правильные ингредиенты, должна достичь детектора со скоростью, что будет не меньше требуемой. Частицы набирают 100 единиц импульса при прохождении радиочастотного резонатора, но это также увеличивает их расфокусировку на 100. Расфокусировку можно уменьшить с помощью квадруполей по 100 единиц за раз. Если расфокусировка превышает 1000, частица разрушается. Большинство компонентов направляют пучок линейно, однако диполи могут изменять траекторию частицы в зависимости от её скорости, что позволяет создавать ответвления и петли.<br><br>Самый простой ускоритель выглядит так: источник частиц, подключённый к нескольким РЧР, затем идут квадруполи для повторной фокусировки и, наконец, детектор, оканчивающий линейную конструкцию ускорителя. Но такая конструкция ограничивает итоговый импульс до значения, пропорционального количеству РЧР. Используя диполи для формирования замкнутого контура, можно заставить частицы проходить один и тот же контур несколько раз (пролетать через одни и те же РЧР и квадруполи). Однако [[большие катушки|Large Coil]], используемые как квадруполями, так и диполями, имеют ограничения на скорость частицы, из чего следует, что частице необходимо покинуть контур при достижении пороговой скорости. Тем не менее, один контур может переходить в другой, где стоят более мощные катушки, которые имеют более высокий предел скорости. Не рекомендуется использовать катушки более высокого уровня сразу, поскольку имеется и минимальное ограничение скорости (однако его достижение не приводит к разрушению частицы). Идеальный и универсальный ускоритель, работающий без штрафов за ограничения - это ускоритель с несколькими замкнутыми контурами, в каждом из которых мощность катушек возрастает. Диполи можно настроить с помощью редстоун-сигнала таким образом, что контуры, разгоняющие выше необходимой скорости, могли бы быть пропущены для своевременной остановки частицы.<br><br>Кроме питания, большинство деталей ускорителя требуют охлаждения. [[Холодный перфторметан|Perfluoromethyl]] необходимо закачать в те компоненты, что возвращают ПФМ комнатной температуры. Тёплый ПФМ можно охладить с целью повторного использования. Для создания холодного ПФМ требуются два [[компрессора|Compressor]], один из них будет сжимать ПФМ до 1 PU, а другой - сжимать ещё раз с получением уже холодного ПФМ.<br><br>Большинство частей ускорителя имеют фиксированное направление движения частицы. Обращайте внимание на красные стрелки на компонентах.<br><br>Пошаговое руководство по сборке самого простого одноконтурного ускорителя можно найти [[здесь|PA Guide]]",
		"zh_cn": "粒子加速器是由多个组件构成的大型动态结构。简而言之，<br>粒子从[[粒子源|Particle Source]]射出，沿着[[束流通道|Beamline]]，经由[[射频腔|RF Cavity]]加速，通过<br>[[四极磁铁|Quadrupole Magnets]]重新聚焦，由[[双极磁铁|Dipole Magnets]]重新定向，<br>最终被[[粒子探测器|Particle Detector]]接收。为了完成配方，<br>使用正确原料的粒子需要以至少所需的速度到达探测器。粒<br>子通过射频腔时获得100点动量，<br>但这同时也会产生100点散焦。散焦可通过四极磁铁一次减少10<br>0点。若散焦超过1000，粒子将撞毁。大多数组件是线性的，<br>然而双极磁铁可根据粒子速度改变其路径，从而实现转弯、<br>分支和环路。最简单的加速器是将粒子源连接到多个射频腔，<br>然后是用于重新聚焦的四极磁铁，最后是探测器，<br>形成一个线性加速器。然而这将最终动量限制为射频腔数量<br>x100。通过使用双极磁铁形成环路，<br>粒子可以循环运动并多次利用相同的射频腔和四极磁铁。然<br>而，四极磁铁和双极磁铁所使用的[[线圈|Large Coil]]对粒子速度有限制，<br>这意味着一旦粒子速度过快，就需要离开环路。不过，<br>一个环路可以通向另一个使用更好线圈（具有更高速度限制）<br>的环路。建议不要立即使用高级线圈，<br>因为线圈也有最低速度限制，<br>尽管这不会立即导致粒子撞毁。一个不受任何线圈惩罚且能<br>执行任何配方的理想加速器是具有多个环路的加速器，<br>每个环路使用更高级的线圈。双极磁铁可通过红石进行配置，<br>以便跳过增加不必要速度的环路，<br>提前结束粒子的路径。除电力外，<br>大多数加速器部件都需要冷却。需要将[[冷四氟甲烷|Perfluoromethyl]]泵入组件<br>中，组件会返回可再次冷却的室温PFM。创建冷PFM需要两组<br>[[压缩机|Compressor]]，一组将PFM压缩至1 PU的压力，另一组进一步压缩，<br>产生冷PFM。加速器的大多数部件都有粒子需要遵循的固定<br>方向。请注意组件上的红色箭头。关于如何建造非常基础的<br>单环加速器的分步指南可在[[此处|PA Guide]]找到。"
	}
}