{
	"name": "PA Guide",
	"icon": [
		"hbm:pa_detector",
		1,
		0
	],
	"trigger": [
		[
			"hbm:pa_detector"
		]
	],
	"title": {
		"en_us": "Particle Accelerator Starter Guide",
		"ru_ru": "Ускоритель частиц: Руководство для начинающих",
		"zh_cn": "粒子加速器入门指南"
	},
	"content": {
		"en_us": "Place a [[particle source|Particle Source]] and connect the front end to a [[beamline|Beamline]]. The front of the source is the part that also looks like a beamline. Ensure that the beamline's orientation, indicated by the red arrows, points away from the source, as this is the direction the particle follows. Place a [[dipole|Dipole Magnets]] fitted with a [[large gold coil|Large Coil]], and configure the top two options (below and above the threshold) to point away from the particle source. In that direction, place another beamline connecting to the dipole, then an [[RF cavity|RF Cavity]], another beamline, a [[quadrupole|Quadrupole Magnets]] fitted with another large gold coil, another beamline, and finally another dipole, again with gold coils. Configure the dipole to do a 90° turn. Not counting the initial source, you should now have one side of the accelerator ring, dipole -> RFC -> quadrupole -> dipole. In the direction that the second dipole turns, repeat that pattern three times, always doing another 90° turn, until the ring is complete. Finally, in the dipole opposite to the source, the one at the end of the first side we built, change the direction of the second setting (direction if the particle meets the threshold) to go straight instead of doing a turn, then set the threshold to 2000. The particle will do five full circles, then the first side again, accumulating a total of 2100 momentum, which is less than the maximum of the gold coils, and then leave the accelerator. In the direction that the particle leaves in, place one last beamline and finally the detector. Connect all parts to electricity and to a source of [[cold perfluoromethyl|Perfluoromethyl]], pipe back the resulting warm perfluoromethyl into a [[compressor|Compressor]], then pipe that into a second compressor, this should create cold PFM again, closing the cooling cycle.<br><br>This setup should be able to perform some of the more basic recipes, and forms the basis on which all accelerators are built. Once you understand the system, it should be trivial to remove the detector and replace it with a larger secondary ring with stronger coils, which allows particles to go even faster. Single ring accelerators are still possible though, as particles that are slower than the coil minimum won't crash immediately, however this means that the accelerator is hit with a hefty penalty, requiring 10x more power, and the ring size needs to match the minimum of the coil, otherwise both penalties stack up and the particle crashes instantly.<br><br>Return to the [[particle accelerator overview page|Particle Accelerator]] and check out all the components individually, understanding the components is crucial in understanding the full accelerator.",
		"ru_ru": "Поместите [[источник частиц|Particle Source]] и соедините его передний конец с [[каналом пучка|Beamline]]. Передний конец источника - это часть, которая выглядит подобно каналу. Убедитесь, что направление канала (красная стрелка) ориентировано от источника, так как именно в этом направлении движется частица. Установите [[диполи|Dipole Magnets]], оснащённые [[большой золотой катушкой|Large Coil]], и установите два верхних параметра верхнего и нижнего порогов так, чтобы они были направлены в сторону от источника частиц. В этом направлении поместите еще один канал пучка, соединяющегося с диполем, теперь [[радиочастотный резонатор|RF Cavity]], ещё один канал, очередной [[квадруполь|Quadrupole Magnets]] с большой золотой катушкой, ещё один канал и, наконец, ещё один диполь, снова с золотой катушкой. Настройте диполь на угол поворота 90°. Не считая источник, должна получиться одна сторона контура ускорителя, диполь -> РЧР -> квадруполь -> диполь. В том направлении, куда обращён второй диполь, повторите эту схему трижды, всегда поворачивая ещё на 90°, пока не получится замкнутый контур. Наконец, в противоположном источнику диполе, который находится в конце первой стороны, измените направление второго параметра (направление частицы, если скорость удовлетворяет пороговому значению) так, чтобы она двигалась прямо, а не поворачивала, а затем установите пороговое значение в 2000. Частица совершит пять полных кругов, затем снова повернёт в первую сторону, набрав суммарно 2100 единиц импульса (что меньше максимального значения для золотых катушек) с последующим покиданием ускорителя. В направлении улетающей частицы поместите последний канал и завершающую часть - детектор. Подсоедините все компоненты к электричеству и источнику [[холодного перфторметаном|Perfluoromethyl]], верните полученный теплый перфторметан по трубе в [[компрессор|Compressor]], пропустите его через второй компрессор для охлаждения.<br><br>Эта установка будет выполнять некоторые из наиболее простых рецептов, на её основе можно построить и другие ускорители. Как только вы разберётесь в системе, вам не составит труда заменить детектор вторичным контуром большего размера с более мощными катушками, что позволит частицам набирать большую скорость. Однако ускорители с одним контуром всё ещё возможны, так как частицы со скоростью ниже минимального порога уничтожаться не будут, однако это означает, что ускоритель подвергается серьёзному штрафу в виде десятикратного потребления энергии, поэтому размер контура должен соответствовать ещё и минимальному значению для катушки, в противном случае слияние обоих штрафов приведёт к разрушению частицы.<br><br>Вернитесь на [[обзорную страницу ускорителя частиц|Particle Accelerator]] и ознакомьтесь со всеми компонентами в отдельности. Понимание компонентов имеет решающее значение для понимания работы ускорителя в целом.",
		"zh_cn": "放置一个[[粒子源|Particle Source]]，<br>并将其前端连接到[[束流管|Beamline]]。源的前端是看起来也像束流管的<br>部分。确保束流管的方向（由红色箭头指示）指向远离源的<br>方向，<br>因为这是粒子行进的方向。放置一个装有[[大型金线圈|Large Coil]]的[[偶极磁铁|Dipole Magnets]]，<br>并将顶部两个选项（阈值以下和以上）配置为指向远离粒子<br>源的方向。在该方向上，<br>放置另一个连接到偶极磁铁的束流管，然后是一个[[射频腔|RF Cavity]]，<br>另一个束流管，一个装有另一个大型金线圈的[[四极磁铁|Quadrupole Magnets]]，<br>另一个束流管，<br>最后是另一个偶极磁铁（同样装有金线圈）。将偶极磁铁配<br>置为90°转弯。不计算初始源，<br>你现在应该有加速器环的一侧：<br>偶极磁铁 -> 射频腔 -> 四极磁铁 -> 偶极磁铁。在第二个偶极磁铁<br>转弯的方向上，重复该模式三次，每次都做另一个90°转弯，<br>直到环完成。最后，<br>在与源相对的偶极磁铁中（即我们建造的第一侧的末端），<br>将第二个设置（如果粒子达到阈值时的方向）的方向更改为<br>直行而不是转弯，<br>然后将阈值设置为2000。粒子将做五个完整的圆圈，<br>然后再走第一侧，总共积累2100点动量，<br>这低于金线圈的最大值，<br>然后离开加速器。在粒子离开的方向上，<br>放置最后一个束流管，<br>最后是探测器。将所有部件连接到电源和[[冷四氟甲烷|Perfluoromethyl]]源，<br>将产生的温热四氟甲烷通过管道送回[[压缩机|Compressor]]，<br>然后通过管道送入第二个压缩机，这应该再次产生冷PFM，<br>完成冷却循环。该装置应该能够执行一些较基础的配方，<br>并构成所有加速器建造的基础。一旦您理解了该系统，<br>移除探测器并将其替换为带有更强线圈的更大的次级环应该<br>是轻而易举的，这允许粒子运行得更快。不过，<br>单环加速器仍然是可能的，<br>因为比线圈最小值慢的粒子不会立即崩溃，<br>但这意味着加速器会受到巨额惩罚，需要10倍以上的电力，<br>并且环的大小需要与线圈的最小值匹配，<br>否则两种惩罚会叠加，<br>粒子会立即崩溃。返回[[粒子加速器概览页|Particle Accelerator]]并单独查看所有组<br>件，理解组件对于理解整个加速器至关重要。"
	}
}