{
	"name": "Particle Source",
	"icon": [
		"hbm:pa_source",
		1,
		0
	],
	"trigger": [
		[
			"hbm:pa_source"
		]
	],
	"title": {
		"en_us": "Particle Source",
		"ru_ru": "Источник частиц",
		"zh_cn": "粒子源"
	},
	"content": {
		"en_us": "Initial component of the [[particle accelerator|Particle Accelerator]], starts particles and runs the simulation. Will begin a recipe if there is at least one item in each input slots.<br><br>The blue info button will dispay the accelerator's previous stats when hovered over. It also shows various messages depending on the previous result or error. The red button cancels an operation, which is useful if a particle is stuck in an infinite loop due to an incorrectly constructed accelerator ring.<br><br>List of messages:<br>* Paused: The particle has reached an unloaded chunk. Chunks need to be loaded for particles to be simulated.<br>* Defocus: The particle has exceeded 1000 points of defocus, indicating that there's not enough quadrupoles in the current ring. May also happen if a particle enters a [[detector|Particle Detector]] while having more than 0 defocus.<br>* Derail: The particle has left the accelerator, either because a part is not connected or because it is oriented incorrectly.<br>* Denied: The particle tried to enter a part of the accelerator it can't, that part may be oriented incorrectly.<br>* No cooling: The particle tried to enter part of the accelerator that doesn't receive necessary cooling.<br>* No power: Part of the accelerator may not be sufficiently powered, including various penalties for not meeting [[coil requirements|Large Coil]]. Also happens if mutliple coil penalties are active at once, due to the power draw exceeding the part's buffer.<br>* Overspeed: The particle has crashed because it has exceeded the maximum operating speed of a coil it passed.<br>* No recipe: The particle has completed an operation, but the ingredients do not create a result.<br>* Underspeed: he particle has completed an operation with valid ingredients, but the final speed was not enough to complete the recipe.<br><br>This component requires cooling through [[cold perfluoromethyl|Perfluoromethyl]]. The returned room temperature fluid can be cooled again using [[compressors|Compressor]].<br><br>This component is one-way only, make sure the particle follows the red arrows!",
		"ru_ru": "Стартовый компонент [[ускорителя частиц|Particle Accelerator]], запускает частицы. Начинает выполнять рецепт, если каждый слот ввода не пуст.<br><br>Синяя справочная кнопка отображает характеристики предыдущего процесса. Также она показывает различные сообщения в зависимости от прошлого результата или ошибки. Красная кнопка отменяет операцию, что необходимо при попадании частицы в ловушку бесконечного цикла из-за неправильно сконструированного контура.<br><br>Список сообщений:<br>* Приостановлено: частица достигла непрогруженного чанка. Для продолжения процесса необходима прогрузка чанка.<br>* Расфокус: расфокусировка частицы превысила 1000 единиц, следовательно, в текущем контуре недостаточно квадруполей. Также это может произойти, если частица влетает в [[детектор|Particle Detector]], имея значение расфокусировки больше 0. <br>* Сход с рельсов: частица внепланово покинула ускоритель: либо стороны не соединены, либо нарушена ориентация.<br>* Отменено: частица безуспешно пыталась войти в компонент ускорителя, что могло случиться из-за его неправильной ориентации.<br>* Нет охлаждения: частица пыталась войти в компонент ускорителя, который не получает необходимого охлаждения.<br>* Нет питания: часть ускорителя не получает достаточно энергии, что возможно и ввиду различных штрафов за несоблюдение [[требований к катушкам|Large Coil]]. Также это происходит, если одновременно активируются несколько штрафов, из-за чего траты превышают буфер энергии компонента.<br>* Превышение скорости: частица разбилась из-за превышения верхнего предела катушки, через которую она прошла.<br>* Нет рецепта: частица завершила операцию, но ингредиенты не дают результата.<br>* Недостаточная скорость: частица завершила операцию с нужными ингредиентами, но не набрала достаточную для завершения рецепта скорость.<br><br>Этот компонент требует охлаждения [[холодным перфторметаном|Perfluoromethyl]]. Отработанную нагретую жидкость можно охладить с помощью [[компрессоров|Compressor]] и использовать повторно.<br><br>Пропускает частицы лишь в одну сторону, ввиду чего необходимо учитывать направление красных стрелок.",
		"zh_cn": "[[粒子加速器|Particle Accelerator]]的起始组件，<br>用于启动粒子并运行模拟。如果每个输入槽中至少有一个物<br>品，<br>则将开始一个配方。蓝色信息按钮在悬停时会显示加速器的<br>先前统计数据。它还会根据先前结果或错误显示各种消息。<br>红色按钮取消操作，<br>如果粒子由于加速器环构造不正确而陷入无限循环，<br>这将非常有用。消息列表：* 暂停：<br>粒子已到达未加载的区块。需要加载区块才能模拟粒子。* <br>散焦：粒子的散焦已超过1000点，<br>表明当前环中的四极磁铁不足。如果粒子在进入[[探测器|Particle Detector]]时散<br>焦大于0，也可能发生这种情况。* 脱轨：<br>粒子已离开加速器，<br>可能是因为部件未连接或方向不正确。* 拒绝：<br>粒子试图进入无法进入的加速器部件，<br>该部件可能方向不正确。* 无冷却：<br>粒子试图进入未接收必要冷却的加速器部件。* 无电力：<br>加速器部件可能未充分供电，<br>包括因未达到[[线圈要求|Large Coil]]而产生的各种惩罚。如果多个线圈惩<br>罚同时激活，由于功耗超过部件的缓冲，<br>也会发生这种情况。* 超速：<br>粒子因超过其通过线圈的最大运行速度而崩溃。* 无配方：<br>粒子已完成操作，但原料无法产生结果。* 速度不足：<br>粒子使用有效原料完成了操作，<br>但最终速度不足以完成配方。该组件需要通过[[冷四氟甲烷|Perfluoromethyl]]进<br>行冷却。返回的室温流体可以使用[[压缩机|Compressor]]再次冷却。该组件<br>只能单向通过，确保粒子跟随红色箭头！"
	}
}