{
	"name": "Fusion Reactor",
	"icon": [
		"hbm:fusion_torus",
		1,
		0
	],
	"trigger": [],
	"title": {
		"en_us": "Fusion Reactor",
		"ru_ru": "Термоядерный реактор",
		"zh_cn": "聚变反应堆"
	},
	"content": {
		"en_us": "A powerful and versatile reactor that fuses light elements into heavier ones. Depending on the setup, reactors may be specialized to make as much power as possible, or to make a lot of byproducts efficiently.<br><br>Components:<br>* [[Fusion Reactor Vessel]]: Core component, this is where the plasma is created<br>* [[Klystron]]: Primary energy source<br>* [[Fusion Reactor Collector Chamber]]: Increases byproduct yield<br>* [[Fusion Reactor Breeding Chamber]]: Uses neutron flux from the vessel to process materials<br>* [[Fusion Reactor Boiler]]: Uses plasma energy to boil water<br>* [[MHD Turbine]]: Uses plasma energy to generate electricity directly<br>* [[Fusion Reactor Coupler]]: Uses plasma energy to generate usable klystron energy, allowing plasma vessels to be chained<br><br>The most basic setup for a fusion reactor is a single plasma vessel (\"torus\"), supplied with power and [[perfluoromethyl|Perfluoromethyl]] cooling, and an air-cooled klystron to ignite its plasma. Depending on its purpose, power-generating parts such as boilers and MHDTs, or byproduct-yielding parts like collectors and breeders may be added.<br><br>More advanced setups may employ couplers to create the energy needed to ignite higher-tier plasmas, creating a setup with two ore more toruses. Byproducts from lower stages can be used for certain higher tier plasma types, so one torus may provide both ignition energy and fuel for another.",
		"ru_ru": "Мощный и многофункциональный реактор, который создаёт более тяжёлые элементы путём слияния более лёгких (синтез). В зависимости от проектировки, реакторы могут быть предназначены как для получения максимально большого количества能量, так и для эффективного получения побочных продуктов.<br><br>Компоненты: <br>* [[Основная камера|Fusion Reactor Vessel]] - краеугольный компонент всей конструкции, в котором создаётся и удерживается плазма<br>* [[Клистрон|Klystron]] - источник первичной энергии<br>* [[Улавливающая камера|Fusion Reactor Collector Chamber]] увеличивает выход побочных продуктов<br>* [[Камера-размножитель|Fusion Reactor Breeding Chamber]] использует нейтронный поток для получения новых материалов<br>* [[Бойлер|Fusion Reactor Boiler]] использует тепло плазмы для нагрева воды<br>* [[МГД-турбина|MHD Turbine]] использует энергию плазмы напрямую для получения электричества<br>* [[Спариватель|Fusion Reactor Coupler]] использует энергию плазмы для поджига плазмы в соседнем реакторе.<br><br>Основная камера, как самый важный компонент, требует питания электричеством и охлаждения [[перфторметаном|Perfluoromethyl]], а также ей необходим клистрон для воспламенения плазмы. Остальные компоненты вроде бойлеров, МГД-турбин, улавливателей или камер размножения могут быть добавлены в соответствии с задачами.<br><br>Спариватели используются для создания продвинутых реакторных схем с несколькими торами, где получается плазма более высокого уровня. Из побочных продуктов ранних этапов работы образуется плазма помощнее: один реактор обеспечивает другой и энергией, и топливом.",
		"zh_cn": "一种强大且多用途的反应堆，\n通过将轻元素融合成更重的元素来运作。根据配置不同，\n反应堆可以专精于最大化发电，\n或高效地产出大量副产品。组件：* [[聚变反应堆容器|Fusion Reactor Vessel]]：\n核心组件，等离子体在此诞生* [[速调管|Klystron]]：主要能量来源* \n[[聚变反应堆收集室|Fusion Reactor Collector Chamber]]：提升副产品产出* [[聚变反应堆增殖室|Fusion Reactor Breeding Chamber]]：\n利用容器产生的中子通量处理材料* [[聚变反应堆锅炉|Fusion Reactor Boiler]]：\n利用等离子体能量烧水* [[磁流体发电机|MHD Turbine]]：\n直接利用等离子体能量发电* [[聚变反应堆等离子体耦合器|Fusion Reactor Coupler]]：\n将等离子体能量转化为可用的速调管能量，\n实现反应堆串联最基础的聚变堆配置是单个等离子体容器（\"\n环形容器\"或\"托卡马克\"），供应电力和[[冷四氟甲烷|Perfluoromethyl]]冷却，\n再加上一台风冷速调管来点燃等离子体。根据用途，\n可添加锅炉、磁流体发电机来发电，或添加收集室、\n增殖室来产出副产品。更高级的配置可以使用耦合器产生点\n燃高级等离子体所需的能量，\n构建包含两个或更多环形容器的系统。低级阶段的副产品可\n用作某些高级等离子体的燃料，\n因此一个环形容器既能为另一个提供点火能量，\n又能提供燃料——这就是传说中的\"左脚踩右脚升天\"技术。"
	}
}