{
	"name": "Fusion Reactor Vessel",
	"icon": [
		"hbm:fusion_torus",
		1,
		0
	],
	"trigger": [
		[
			"hbm:fusion_torus"
		]
	],
	"title": {
		"en_us": "Fusion Reactor Vessel",
		"ru_ru": "Основная камера",
		"zh_cn": "聚变反应堆容器"
	},
	"content": {
		"en_us": "\"Torus\", main component of the [[fusion reactor|Fusion Reactor]], uses fuel and energy from a [[klystron|Klystron]] to generate plasma. Also requires electricity and cooling via [[perfluoromethyl|Perfluoromethyl]] to operate.<br><br>Features four connection ports for external components. Devices that use plasma energy (and not just neutron flux) split the total output, a single component will receive 100% of the energy, two components will receive 62.5% each and three components get 50% each. Therefore, using multiple [[boilers|Fusion Reactor Boiler]] or [[MHDTs|MHD Turbine]] increases the total energy output, although with diminishing returns. Flux levels are not affected when shared, the output remains steady across all ports no matter how many attachments are used.<br><br>Both the buffered electric charge and fuel levels determine working speed, if either is below 50%, the reactor will start to throttle, burning slower and decreasing output energy. The klystron energy does not affect processing speed, too little energy will simply fail to ignite the plasma, and more energy will not accelerate the reaction.",
		"ru_ru": "Главный компонент [[термоядерного реактора|Fusion Reactor]]. Генерирует плазму, используя энергию [[клистрона|Klystron]] и топливо. Требует электричество и охлаждение [[перфторметаном|Perfluoromethyl]].<br><br>Имеет четыре порта для подключения внешних компонентов. Если имеются несколько устройств, одновременно потребляющих энергию плазмы (вроде турбин или бойлеров), то энергия будет распределяться так, что единственный потребитель получит 100% энергии, каждый из двух механизмов будет получать по 62.5% исходного количества, а каждый из трёх - по 50%. Да, использование нескольких [[бойлеров|Fusion Reactor Boiler]] или [[МГДТ|MHD Turbine]] увеличивает суммарное количество выходной энергии. Это и есть правило совместного использования портов. На поток нейтронов оно не распространяется – поток будет постоянен вне зависимости от количества потребителей.<br><br>И уровень энергии в буфере, и запас топлива влияют на скорость работы реактора: если какой-либо из показателей будет ниже 50%, реактор начнёт глохнуть, т.е. снизится скорость сгорания плазмы и выход энергии. Работа клистрона не влияет на скорость процесса: плазма просто не воспламенится, если энергии будет слишком мало, а излишнее её количество не ускорит реакцию.",
		"zh_cn": "\"环形容器\"（Torus，物理学家们看了会会心一笑），<br>[[聚变反应堆|Fusion Reactor]]的核心组件，<br>利用[[速调管|Klystron]]提供的能量和燃料来产生等离子体。同时需要电<br>力和[[冷四氟甲烷|Perfluoromethyl]]冷却才能运行。拥有四个外接组件端口。使<br>用等离子体能量的设备（不仅仅是中子通量）会共享总输出：<br>单台设备获得 100% 能量，两台各获得 62.5%，<br>三台各获得 50%。因此，<br>使用多台[[锅炉|Fusion Reactor Boiler]]或[[磁流体发电机|MHD Turbine]]会增加总能量输出，<br>虽然会有边际效益递减。但中子通量水平不受共享影响——<br>无论连接多少附件，<br>所有端口的中子输出都保持恒定。缓冲电荷和燃料储量共同<br>决定工作速度：如果任一项低于 50%，反应堆将开始节流，<br>燃烧变慢并降低能量输出。速调管能量不影响处理速度——<br>太少会点不着等离子体，<br>但再多也不会加速反应。这就是聚变界的\"要么全有，<br>要么全无\"原则。"
	}
}